import {PerceptionChannelTypes} from "../../../../models/Poll.model";

const PerceptionChannelDescription = {
  [PerceptionChannelTypes.Audio]: (
    <>
      <p>Аудиалы, визуалы, кинестетики и дигиталы отличаются друг от друга по характеру, способу общения и внешним
        признакам. Люди с разными доминирующими репрезентативными системами по-разному воспринимают мир.</p>

      <p>У аудиалов доминирующим является орган слуха и соответствующее ему мировосприятие посредством звуков, тембров,
        мелодий, громкости. При этом другие формы оценки мира у таких людей развиты не меньше, но им проще и удобнее
        обрабатывать поступающую информацию именно через слух. В общении с другими людьми они обращают особенное
        внимание на их речь, тембр их голоса. Аудиалы часто используют в своей речи выражения вроде «мне послышалось»,
        «рада тебя слышать», «это громко сказано», «идея звучит заманчиво».</p>

      <p>Главная черта аудиалов – ориентировка в мире по звукам. Они – меломаны, любят напевать. Профессиональная
        деятельность аудиала часто связана с музыкой и межкультурной коммуникацией. Такие люди способны внимательно
        слушать на протяжении длительного времени, являются прекрасными собеседниками. Общаться с аудиалом приятно. Их
        речь грамотна, богата интонациями, а темп ее комфортен для восприятия. Партнеров по общению они понимают с
        полуслова. Однако повышенный тон и оскорбления в адрес аудиала приведут к тому, что он откажется от общения.
        Аудиалы меньше других склонны к конфликтам и чаще предпочитают не повышать голос.</p>
    </>
  ),

  [PerceptionChannelTypes.Visual]: (
    <>
      <p>Аудиалы, визуалы, кинестетики и дигиталы отличаются друг от друга по характеру, способу общения и внешним
        признакам. Люди с разными доминирующими репрезентативными системами по-разному воспринимают мир.
      </p>

      <p>Особенностью визуалов является их восприятие мира посредством зрительных образов. Доминирующий орган чувств у
        них
        — глаза. При этом другие формы оценки мира у таких людей развиты не меньше, но им проще и удобнее обрабатывать
        поступающую информацию именно через зрение. Для них имеет значение цвет и форма.
      </p>

      <p>Для визуалов свойственна выраженная жестикуляция. В общении с другими людьми они обращают особенное внимание на
        их внешность, мимику, жесты и позы. У них отлично развито воображение и они часто используют в своей речи
        выражения
        вроде «вот увидим», «стоит заметить», «мне кажется», «палитра эмоций», «образно говоря», "посмотрим".
      </p>

      <p>Визуал восприимчив ко всему, что видит. Такие люди ценят красоту мира и отдельных его предметов. Они не любят
        грязь, неряшливость и беспорядок.
      </p>

      <p>У людей этого типа отлично развита зрительная память, они лучше других запоминают положение предметов и
        ориентируются на местности. В процессе обучения предпочитают воспринимать информацию в схематичном,
        иллюстрированном виде, работать с графиками, рисунками и фотографиями. Данный тип значительно лучше прочих видов
        воспринимает информацию посредством чтения.
      </p>
    </>
  ),

  [PerceptionChannelTypes.Kinesthetic]: (
    <>
      <p>Аудиалы, визуалы, кинестетики и дигиталы отличаются друг от друга по характеру, способу общения и внешним
        признакам. Люди с разными доминирующими репрезентативными системами по-разному воспринимают мир.
      </p>

      <p>Особенностью кинестетиков является их восприятие мира посредством их эмоциональных и телесных откликов.
        Доминирующий орган чувств у них — их собственное тело. При этом другие формы оценки мира у таких людей развиты
        не меньше, но им проще и удобнее обрабатывать поступающую информацию именно через свои физические ощущения.
      </p>

      <p>Этот тип людей часто используют в своей речи выражения вроде «не выношу этого», «ощутимый результат», «мурашки
        по коже», «теплые воспоминания».
      </p>

      <p>Главной характеристикой кинестетиков является восприимчивость ко всему, что происходит вокруг них. В жизни они
        ценят комфорт и красивую обстановку. Кинестетик часто в речи обращается к ощущениям и говорит о своих эмоциях.
        Они
        обладают яркой мимикой и жестикуляцией, которые многое могут сказать о них.
      </p>

      <p>Такие люди очень активны, легки на подъем, быстро включаются в работу, которая связана с практическими
        действиями
        и ручным трудом. Как правило, они находят себя в творческих профессиях, рутинная работа и монотонная
        деятельность
        им противопоказаны.
      </p>

      <p>
        Для кинестетиков условием хорошей беседы является обстановка. Им доставляет истинное удовольствие обсуждение
        личностных переживаний и эмоций, как своих, так и чужих. Однако люди этого типа часто стремятся нарушить личное
        пространство других, ведь для них важно прикоснуться, потрогать. Не смотря на это. Незнакомого человека,
        кинестетик к себе не подпустит. Видя новый предмет, они не просто его рассматривают, а стремятся пощупать, лишь
        тогда они могут сформировать полное представление. А одежда для них должна быть в первую очередь удобной.
      </p>
    </>
  ),

  [PerceptionChannelTypes.Digital]: (
    <>
      <p>
        Аудиалы, визуалы, кинестетики, дигиталы отличаются друг от друга по характеру, способу общения, внешним
        признакам.
        Люди с разными доминирующими репрезентативными системами по-разному воспринимают мир.
      </p>

      <p>
        Дигиталы - сравнительно недавно выделенный, редкий психотип, взаимодействующий с окружающим миром на основании
        логики и рациональности. Аудиальный, визуальный и кнестетический каналы восприятия у них развиты не так
        сильно,как
        у соответсвующих им типов людей, однако они используют все три канала для анализа сиутации.
      </p>

      <p>
        Дигиталам важно логически понять ситуацию. Их несомненным достоинством является способность сохранять
        спокойствие
        и здраво мыслить в стрессовой ситуации . Они все склонны систематизировать, структурировать.
      </p>

      <p>
        Они часто воспринимают информацию буквально, изначально не задумываясь о том, что за ней может стоять.
        Считается,
        что они могут становиться манипуляторами, подстраиваясь под других и подражая их поведению.
      </p>

      <p>
        В речи дигиталов всегда много логики. По характеру они обычно спокойны и уравновешены. В их речи постоянно
        используются такие слова, как «логично», «правильно», «во-первых», «следовательно», «таким образом» и т.д.
      </p>

      <p>
        Дигиталы, как и все остальные, стремятся к комфорту, но для них комфорт – это отсутствие рядом глупых людей.
        Естественно, делят людей на умных и глупых они самостоятельно по одним им известным критериям.
      </p>

      <p>
        Дискреты никого не хотят обидеть и не идут первыми на конфликт. Однако за ними часто наблюдают так называемую
        ложную бестактность. Поведение дигиталов довольно часто приводит в недоумение людей., хотя такие особы просто не
        способны на тактичность в общепринятом смысле этого слова. У них просто есть способность высказаться не во время
        и
        не по адресу при анализе чужого поведения.
      </p>
    </>
  )
};

export default PerceptionChannelDescription;
